app/controllers/notebooks_controller.rb

SELECT * FROM "notebooks"
---
  def index
    @notebooks = Notebook.all

INSERT INTO "notebooks" ("created_at", "updated_at", "researcher_id") VALUES('2010-07-09 06:27:22', '2010-07-09 06:27:22', NULL)
---
  def create
    @notebook = Notebook.new(params[:notebook])

    respond_to do |format|
      if @notebook.save