app/controllers/projects_controller.rb

SELECT * FROM "projects"
---
  def index
    @projects = Project.all

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES('Project Vulcan', '2010-06-30 04:32:09', '2010-06-30 04:32:09')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save