app/controllers/researchers_controller.rb

SELECT * FROM "researchers"
---
  def index
    @researchers = Researcher.all

SELECT * FROM "researchers" WHERE ("researchers"."id" = 1)
---
  def show
    @researcher = Researcher.find(params[:id])

INSERT INTO "researchers" ("name", "created_at", "updated_at") VALUES('Harold', '2010-06-30 04:30:48', '2010-06-30 04:30:48')
---
  def create
    @researcher = Researcher.new(params[:researcher])

    respond_to do |format|
      if @researcher.save